# Тихонович Данила Вариант 5
print("start code ...")

books = [
    {
        "title": "Мастер и Маргарита",
        "author": "Михаил Афанасьевич Булгаков",
        "year": "1929"
    },
    {
        "title": "Сто лет одиночество",
        "author": "Габриэль Гарсиа Маркес",
        "year": "1967"
    },
    {
        "title": "Война и мир",
        "author": "Лев Николаевич Толстой",
        "year": "1896"
    },
    {
        "title": "Маленький принц",
        "author": "Антуан де Сент-Экзюпери",
        "year": "1943"
    },
    {
        "title": "Преступление и наказание",
        "author": "Фёдор Михайлович Достоевский",
        "year": "1866"
    }
]

count = 1

for book in books:
    print("-" * 25 + f" Книга {count} " + "-" * 25)
    print(f"Название: {book['title']}; Автор: {book['author']}")
    print("-" * 25 + f" {book['year']} " + "-" * 25)
    print()  
    count += 1

print("end code") 

